---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DimensionSegment Properties
DimensionSegment Class See Also Send Feedback
---

The DimensionSegment type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Above | The text shown above the segment's value. |
|  | Below | The text shown below the segment's value. |
|  | IsLocked | Indicates if this segment is locked. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
|  | LeaderEndPosition | The position of the dimension leader end point. |
|  | Origin | The segment origin. |
|  | Prefix | The text shown before the segment's value. |
|  | Suffix | The text shown after the segment's value. |
|  | TextPosition | The position of the dimension text's drag point. |
|  | Value | The length of the segment. |
|  | ValueOverride | The text that replaces the segment's value. |
|  | ValueString | The displayed value shown for the dimension segment. |

# See Also

DimensionSegment Class

Autodesk.Revit.DB Namespace